basic_case/system/createPatchDict.1
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |				
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8                                   	
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pointSync false;

// Patches to create.
patches
(

    {
        // Name of new patch
        name inlet;

        // Type of new patch
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (minX);
    }

    {
        // Name of new patch
        name outlet;

        // Type of new patch
        patchInfo
        {
            type patch;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (maxX minY maxY minZ maxZ);
    }

//    {
//        // Name of new patch
//        name walls;
//
//        // Type of new patch
//        patchInfo
//        {
//            type wall;
//        }
//
//        // How to construct: either from 'patches' or 'set'
//        constructFrom patches;
//
//        // If constructFrom = patches : names of patches. Wildcards allowed.
//        patches (minZ maxZ minY maxY);
//    }

    {
        // Name of new patch
        name sphere;

        // Type of new patch
        patchInfo
        {
            type wall;
        }

        // How to construct: either from 'patches' or 'set'
        constructFrom patches;

        // If constructFrom = patches : names of patches. Wildcards allowed.
        patches (stlSurface);
    }
);

// ************************************************************************* //
