basic_case/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v13                                   |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    sphere
    {
        type            zeroGradient;
    }
    
    inlet
    {
        type            fixedValue;
        value           uniform 1;
    }
    
    outlet
    {
        type            zeroGradient;      // Zero gradient at outlet
    }
    
    walls
    {
        type            zeroGradient;
    }
    
//   defaultFaces
//   {
//       type            empty;
//   }
}

// ************************************************************************* //
