basic_case/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v13                                   |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// == SOLVER SETTINGS ==
// These work for shockFluid and rhoCentralFoam in OpenFOAM-13
solvers
{
    "(rho|rhoU|rhoE).*"
    {
        solver          diagonal;
    }

    "U.*"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-09;
        relTol          0.01;
    }

    "e.*"
    {
        $U;
        tolerance       1e-10;
        relTol          0;
    }
}

PIMPLE{}

// == TIME CONTROL FOR DYNAMIC MESH ==
//relaxationFactors
//{
//    fields
//    {
//        p               0.3;
//        rho             0.3;
//    }
//}
//
//// == PIMPLE SETTINGS FOR COMPRESSIBLE + DYNAMIC MESH ==
//PIMPLE
//{
//    nOuterCorrectors     2;     // 1-3 for stability with AMR
//    nCorrectors          2;     // 1-3 for stability
//    nNonOrthogonalCorrectors 1;
//    
//    pRefCell             0;
//    pRefValue            0;
//    
//    residualControl
//    {
//        p               1e-4;
//        U               1e-4;
//        "(e|rho)"       1e-4;
//    }
//}
